{"description":"An Interview with Gayle FormanQ: You started your career as a journalist and your first book is a travelogue about going around the world. Is YA literature a departure for you?Gayle Forman: Actually, it&#x2019;s more of a homecoming. My first writing job was at Seventeen, where I spent five years on staff and as a contributor reporting the magazine&#x2019;s social-issues stories. I loved writing for teens then because&#x2014;contrary to popular opinion&#x2014;they really care about serious issues (from child soldiers in Africa to kids embroiled in the drug war here) and the engage in their reading with such passion. So, now that I&#x2019;m writing young-adult literature, it feels like I&#x2019;ve come full circle.Q:  This book explores some serious themes. Why is this a book for kids and not adults?GF: It&#x2019;s a book for kids precisely because it explores serious themes. Teenagers are grappling with choices about life and love as much as adults, so why shouldn&#x2019;t their reading reflect that? I don&#x2019;t set out to write YA. It just seems like I&#x2019;m drawn to stories about young people. That said, I think If I Stay is for adults, too. I love the idea of teens reading this book and then handing it off to their parents.Q:  Many key characters are serious musicians, and songs are referenced throughout the book. Are you a musician?GF: No. Except for piano lessons when I was a kid and a brief spate of guitar playing in my teens, I&#x2019;ve never played an instrument. I am, however, a huge music fan. And my husband is a musician; he was playing in a punk band when we met, so I&#x2019;ve spent a lot of my life ensconced in that scene. I seem drawn to writing about musicians, though I&#x2019;ve never been all that interested in the cello until Mia popped into my head.Q:  What inspired you to write this book?GF: Music. Oregon. People I have loved. And unfortunately, the book is inspired by a real-life tragedy that happened several years ago.Q: This is a book about death, but it&#x2019;s not depressing. Why is that?GF: Maybe because it&#x2019;s really about the power of love&#x2014;of family, friends, music&#x2014;and therefore it ultimately affirms life.--This text refers to an out of print or unavailable edition of this title.","asin":"014241543X","salesRank":1}
{"description":"Amazon Best Books of the Month, June 2012: On the day of their fifth wedding anniversary, Nick's wife Amy disappears. There are signs of struggle in the house and Nick quickly becomes the prime suspect. It doesn't help that Nick hasn't been completely honest with the police and, as Amy's case drags out for weeks, more and more vilifying evidence appears against him. Nick, however, maintains his innocence. Told from alternating points of view between Nick and Amy, Gillian Flynn creates an untrustworthy world that changes chapter-to-chapter. CallingGone Girla psychological thriller is an understatement. As revelation after revelation unfolds, it becomes clear that the truth does not exist in the middle of Nick and Amy's points of view; in fact, the truth is far more dark, more twisted, and more creepy than you can imagine.Gone Girlis masterfully plotted from start to finish and the suspense doesn't waver for one page. It's one of those books you will feel the need to discuss immediately after finishing because the ending doesn't just come; it punches you in the gut.--Caley Anderson","asin":"0307588378","salesRank":4}
{"description":"&#8220;Fans of Divergent who can&#8217;t get enough&#151;and maybe even the rare reader who missed the first rush&#151;will snap up this relatively stand-alone story collection told from the perspective of Tobias (aka Four).&#8221;&#8221; (ALA Booklist)","asin":"0062345214","salesRank":6}
